---
kind: method
id: M:Autodesk.Revit.DB.IntegerRange.Dispose
source: html/4b780bab-e91c-2e64-9907-e914b695e426.htm
---
# Autodesk.Revit.DB.IntegerRange.Dispose Method

Releases all resources used by the IntegerRange

## Syntax (C#)
```csharp
public void Dispose()
```